oekter.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="no" xml:lang="no">
<head>
<!-- 2018-08-22 on. 15:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Økter</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tarjei Bærland" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css">
<link href='https://fonts.googleapis.com/css?family=Open Sans' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css?family=Source Code Pro' rel='stylesheet'>


</head>
<body>
<div id="content">
<h1 class="title">Økter</h1>
<div id="table-of-contents">
<h2>Innhold</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga6c7cdd">Uke 34</a>
<ul>
<li><a href="#orgbe17437">Introduksjon</a></li>
<li><a href="#org1c08436">Notater</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Generell oversikt finner du på <a href="edvardmunch.html#org7149a49">Edvard Munch - datoer</a>.
</p>

<div id="outline-container-orga6c7cdd" class="outline-2">
<h2 id="orga6c7cdd">Uke 34</h2>
<div class="outline-text-2" id="text-orga6c7cdd">
</div>

<div id="outline-container-orgbe17437" class="outline-3">
<h3 id="orgbe17437">Introduksjon</h3>
<div class="outline-text-3" id="text-orgbe17437">
<ul class="org-ul">
<li>Se på <a href="https://tarjeiba.github.io/promo/promo.html#org99cf12d">https://tarjeiba.github.io/promo/promo.html#org99cf12d</a></li>
<li>Hvis ikke python er lagt inn på maskinene. <a href="https://repl.it">https://repl.it</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1c08436" class="outline-3">
<h3 id="org1c08436">Notater</h3>
<div class="outline-text-3" id="text-org1c08436">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">print</span>(<span class="org-string">"Hello world!"</span>) <span class="org-comment-delimiter"># </span><span class="org-comment">I Python, er #-tegnet mbrukt til kommentarer</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
<span class="org-keyword">print</span>(<span class="org-string">"Hello world!"</span>)
<span class="org-variable-name">hei</span> = <span class="org-string">"V&#230;r hilset!"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">lagrer "v&#230;r hilset!" som variabel hei</span>
<span class="org-keyword">print</span>(hei) <span class="org-comment-delimiter"># </span><span class="org-comment">her er 'hei' et variabelnavn</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Hvorfor gir print(hei) feil?</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Datatyper</span>
<span class="org-variable-name">a</span> = 3 <span class="org-comment-delimiter"># </span><span class="org-comment">heltall</span>
<span class="org-variable-name">b</span> = 3.1 <span class="org-comment-delimiter"># </span><span class="org-comment">kommatall, flyttall</span>
<span class="org-variable-name">c</span> = <span class="org-string">"Dette er tekst"</span> <span class="org-comment-delimiter"># </span><span class="org-comment">teksstreng</span>
<span class="org-variable-name">d</span> = <span class="org-string">'Dette er ogs&#229; en tekststreng'</span>
<span class="org-variable-name">e</span> = <span class="org-string">'Dette er en tekststreng med "anf&#248;rselstegn"'</span>

<span class="org-builtin">input</span>(<span class="org-string">"Det som skal st&#229; p&#229; skjermen"</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter"># </span><span class="org-comment">Et program som dobler et tall</span>
<span class="org-variable-name">tall</span> = <span class="org-builtin">input</span>(<span class="org-string">"Gi meg et tall:"</span>) <span class="org-comment-delimiter"># </span><span class="org-comment">tall er n&#229; en tekststreng</span>
<span class="org-variable-name">tall</span> = <span class="org-builtin">float</span>(tall)
<span class="org-keyword">print</span>(<span class="org-string">"tall:"</span>, tall)

<span class="org-keyword">print</span>(<span class="org-string">"Det dobbelte av tall er:"</span>)
<span class="org-variable-name">dobbelt</span> = tall * 2
<span class="org-keyword">print</span>(dobbelt)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">3 ** 2 <span class="org-comment-delimiter"># </span><span class="org-comment">3^2</span>
</pre>
</div>


<div class="TASK">
<ul class="org-ul">
<li>Be om et navn, skriv ut "Hei på deg, {navn}"    # Husk print("Hei på deg", navn)</li>

<li>Be om ett tall, skriv ut tallet opphøyd i andre.</li>
<li>Be om ett tall, skriv ut tre lavere enn tallet, så ganger to # Test med tall = 1 =&gt; -4</li>
<li>Be om ett tall, skriv ut det dobbelte av tallet i fjerde</li>

<li>Be om to tall, skriv ut summen av dem</li>
<li>Be om to tall, skriv ut produktet av dem</li>
<li>Be om to tall, skriv ut det første opphøyd i det andre</li>
</ul>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
